development/backpack/private/app/controllers/snapshots_controller.rb

SELECT "snapshots".* FROM "snapshots"
---
  def index
    @snapshots = Snapshot.all

SELECT "snapshots".* FROM "snapshots" WHERE "snapshots"."id" = ? LIMIT ?  [["id", 980190962], ["LIMIT", 1]]
---
    def set_snapshot
      @snapshot = Snapshot.find(params[:id])